const title = 'Birzeit University Department of Urban Planning and Landscape Architecture Advisory Plan';
const note = '';
const link_title = '';
const url = '';
const link_more_info = '';

const courses = [
    //['NAME', 'CODE', ['requirement']s, 'notes']

    [' مهارات بصرية 1', 'ENAR1111', []],
    ['رسم معماري', 'ENAR1211',[]],
    ['مهارات اللغة العربية 1', 'ARAB135', []],
    ['الفيزياء العامة 1', 'PHYS141',[]],
    ['التفاضل والتكامل1', 'MATH1411', []],
    ['لغة إنجليزية مستوى متوسط 1', 'ENGC1201', []],
    ['مختبر الفيزياء العامة 1', 'PHYS111', ['PHYS141']],


    ['لاب فيزيا 2', 'PHYS112', ['PHYS132','PHYS111'], 'يؤخذ صيفا',9],
    ['كيمياء لطلبة الهندسة', 'CHEM143', [], 'يؤخذ صيفا',9],
    ['استاتيكا', 'ENCE232', ['PHYS141','MATH1411'], 'يؤخذ صيفا',9],


    'year 1 semester2',
    ['مهارات اللغة العربية 2', 'ARAB136', ['ARAB135']],
    ['التفاضل والتكامل 2', 'MATH1321', ['MATH1411']],
    ['لغة إنجليزية مستوى متوسط 2', 'ENGC1202', ['ENGC1201']],
    ['مبادئ عمارة', 'ENAR1311', []],
    ['مشغل', 'ENME120', []],
    ['فيزياء 2', 'PHYS132', ['PHYS141', 'MATH1411']],




    'year 2 semester 1',
    ['تصميم الفراغات المفتوحة', 'ENPL231', ['ENAR1311']],
    ['تاريخ عمارة 1', 'ENAR229', []],
    ['مهارات ومنظور', 'ENAR243', ['ENAR1211','ENAR1111']],
    ['جغرافيا بشرية', 'GEOG230', []],
    ['اختياري جامعة', ' ', []],


    'year 2 semester 2',
    ['تصميم المشهد', 'ENPL232', ['ENPL231']],
    ['تاريخ التخطيط ', 'ENPL234', ['ENAR229']],
    ['انشاء المباني', 'ENAR3391', ['ENAR1211']],
    ['البستنة وااليكولوجيا', 'ENPL236', ['ENPL231']],
    ['اختياري جامعة', ' ', []],


    ['ميكانيكا', 'ENCE223', ['ENCE232'], 'يؤخذ صيفا',9],
    ['سي اس اوربية', 'CULS331', [], 'اجتياز 30 ساعة <br>يؤخذ صيفا',9],




    'year 3 semester 1',
    ['تصميم االسكان', 'ENPL331', ['ENPL231']],
    ['نظريات العمارة', 'ENAR329', ['ENAR229']],
    ['اسس التخطيط الفراغي 1', 'ENPL333', ['ENPL234']],
    ['الرسم بالحاسوب', 'ENAR3201', []], // 60 HOURS SHOULD BE DONE
    ['مختبر مساحة', 'ENCE317', ['ENCE327']], // او متزامن
    ['الكارتوغرافي', 'GEOG232', []],
    ['التشريعات وقوانين التخطيط الفراغي', 'ENPL335', []],

    'year 3 semester 2',
     ['التطوير واالحياء العمراني', 'ENPL332', ['ENPL331']],
    ['نظريات التخطيط', 'ENPL336', ['ENPL234']],
    ['العمارة في فلسطين', 'ENAR3301', ['ENAR2381']], //  ENAR2381 أو ENAR329
    ['GIS', 'ENPL338', ['ENAR3201','GEOG232']],
    ['اسس التخطيط الفراغي2', 'ENPL334', ['ENPL333']],
    ['سي اس عربية', 'CULS332', [], 'اجتياز 30 ساعة <br>يؤخذ صيفا',9],



    'year 4 semester 1',
  ['التخطيط البيئي', 'ENPL421', ['ENPL334']],
    ['هندسة المواصلات', 'ENCE431', ['ENPL334']], //or ENCE337
    ['مدخل الى تخطيط البنية التحتية', 'ENPL433', ['ENPL334']],
    [' االحصاء التخطيطي', 'ENPL422', ['ENPL333']],
    ['ايكولوجية المشهد', 'ENPL425', ['ENPL234','ENPL236']],
    ['علم اجتماع حضري', 'S0C1333', []],





    'year 4 semester 2',
      ['مهارات متقدمة', 'ENPL412', []],
    ['ندوة في التخطيط الفراغي', 'ENPL414', ['ENPL336']],
    ['تخطيط وتطوير الطرق', 'ENPL434', ['ENPL421']],
    ['تخطيط المناطق الريفية', 'ENPL437', ['ENPL332','ENPL335']],
    ['ادارة مشاريع', 'ENPL438', ['ENPL332','ENPL334']],
    ['تدريب عملي', 'ENPL4300', [], 'يؤخذ صيفا',9],




    'year 5 semester 1',
   ['مقدمة مشروع التخرج', 'ENPL520', ['ENPL4300','ENPL437']],
    ['التخطيط الفراغي المتقدم', 'ENPL531', ['ENPL437']],
    ['اسس التخطيط االقليمي', 'ENPL537 ', ['ENPL336']],
    ['ادارة االراضي', 'ENPL539', ['ENPL335']],




    'year 5 semester 2',
   ['مشروع التخرج', 'ENPL530', ['ENPL520']],
    ['اختياري تخصص', ' ', []]

    
];
