const title = 'Birzeit University Doctor of Pharmacy Advisory Plan';
const note = ' ';
const link_title = ' ';
const url = ' ';
const link_more_info = ' ';
/*
    notes:-
        1) course format is //['NAME', 'CODE', ['requirement']s, 'notes']
        2) 'notes' is not required
        3) you have to separate between the semesters by a string like: '', 'year 1 semester2'
        4) when there no requirements leave the array empty [] not ['']
        5) when there no 'CODE' (course code) write ' ' not ''
        6) you can use html tags like table, like: `<table><tr><th>المتطلبات</th><th>المادة</th></tr>
                                                    <tr><td>ENCS3320</td><td>*(2)شبكات الحاسوب المتقدمة</td></tr>
                                                    <tr><td>ENCS4370, ENCS3390</td><td>*(3)عمارة الحاسبات المتقدمة</td></tr>
                                                    <tr><td>ENCS3340</td><td>*(4)تعلم الآلة وعلم البيانات</td></tr>
                                                    </table>`
                                                    or
                                                    '<table><tr><th>المتطلبات</th><th>المادة</th></tr>'
                                                    + '<tr><td>ENCS3320</td><td>*(2)شبكات الحاسوب المتقدمة</td></tr>'
                                                    + '<tr><td>ENCS4370, ENCS3390</td><td>*(3)عمارة الحاسبات المتقدمة</td></tr>'
                                                    + '<tr><td>ENCS3340</td><td>*(4)تعلم الآلة وعلم البيانات</td></tr>'
                                                    + '</table>'
        7) separatelines in notes by <br> not \n like: '*COMP230 أو COMP133<br>*مستوى سنة 3'
*/
const courses = [
    //['NAME', 'CODE', ['requirement']s, 'notes']
    //'year 1 semester 1',
    ['مختبر الأحياء العامة', 'BIOL111', ['BIOL131']],
    ['الأحياء العامة', 'BIOL131',[]],
    ['مختبر الكيمياء العامة 1', 'CHEM111', ['PHYS141']],
    ['الكيمياء العامة 1', 'CHEM141', []],
    ['التفاضل والتكامل للعلوم الصحية', 'MATH1431', []],
    ['مهارات اللغة العربية 1', 'ARAB135', []],
    ['لغة إنجليزية مستوى متوسط 1', 'ENGC1201', []],
    
    'year 1 semester2',
    ['الأحياء العامة 2', 'BIOL132', ['MATH1411']],
    ['مختبر الكيمياء العامة 2', 'CHEM112', ['CHEM141']],
    ['الكيمياء العامة 2', 'CHEM132', ['CHEM141']],
    ['اختياري كلية', ' ', []],
    ['مهارات اللغة العربية 2', 'ARAB136', ['ARAB135']],
    ['لغة إنجليزية مستوى متوسط 2', 'ENGC1202', ['ENGC1201']],

    'year 2 semester 1',
    ['علم الأحياء الدقيقة', 'BIOL243', []],
    ['الكيمياء التحليلية 1', 'CHEM234', []],
    ['الكيمياء العضوية 1', 'CHEM241', ['MATH1411']],
    ['مقدمة في علم الصيدلة وحساباتها', 'PHAR231', ['MATH1321']],
    ['الفسيولوجيا البشرية وعلم التشريح 1', 'PHAR233', ['BIOL132']],
    ['لغة إنجليزية مستوى متوسط 3', 'ENGC2201', ['ENGC1202']],
    
    'year 2 semester 2',
    ['مختبر الكيمياء العضوية', 'CHEM221', []],
    ['الكيمياء العضوية 2', 'CHEM242', []],
    ['صيدلة فيزيائية', 'PHAR232', ['PHAR231']],
    ['الفسيولوجيا البشرية وعلم التشريح 2', 'PHAR243', ['PHAR233']],
    ['الفيزياء العامة (لطلبة العلوم الصحية والحيوية)', 'PHYS1431 ', []],
    ['لغة إنجليزية مستوى متوسط 4', 'ENGC2202', ['ENGC2201']],

    'year 3 semester 1',
    ['الكيمياء الحيوية 1', 'BIOC331', ['BIOL131','CHEM230','CHEM242'],'أو تزامن'],
    ['قوانين وأخلاقيات الصيدلة', 'PHAR324', ['PHAR231']],
    ['صيدلانيات 1', 'PHAR331', []],
    ['التغذية الإكلينيكية والعلاج بالحمية', 'PHAR322', ['BIOC331']],
    ['علم الأدوية 1', 'PHAR341', ['PHAR243','BIOC331'],'أو تزامن <br> أوالاكتفاء بمساق PHAR351 أو اخذه بالتزامن'],
    ['فسيولوجيا الأمراض 1', 'PHAR3310', []],

    'year 3 semester 2',
    ['مختبر مهارات صيدلانية', 'PHAR321', ['PHAR331'],'أو تزامن'],
    ['فسيولوجيا الأمراض 2', 'PHAR331', ['PHAR232']],
    ['صيدلانيات 2', 'PHAR332', ['PHAR331']],
    ['النواتج الطبيعية والتداوي بالأعشاب الطبية', 'PHAR333', ['BIOC331','CHEM242']],
    ['الكيمياء الحيوية الطبية', 'PHAR334', ['BIOC331']],
    ['علم الأدوية 2', 'PHAR342', ['PHAR341']],

    'year 4 semester 1',
    ['الإحصاء الحيوي وعلم الأوبئة', 'PHAR222', []],
    ['ممارسة الرعاية الصيدلانية', 'PHAR422', ['PHAR231', 'PHAR342']],
    ['الكيمياء السريرية', 'PHAR431', ['PHAR334']],
    ['كيمياء الدواء 1', 'PHAR432', ['CHEM242', 'PHAR342']],
    ['صيدلة صناعية', 'PHAR441', ['PHAR332']],
    ['اختياري تخصص', ' ', []],
    
    'year 4 semester 2',
    ['تقييم المعلومات والمراجع الدوائية', 'PHAR421', ['PHAR222','PHAR342']],
    ['كيمياء الدواء 2', 'PHAR433', ['PHAR432']],
    ['صيدلة حيوية والحركة الدوائية', 'PHAR434', ['PHAR332']],
    ['أدوية دون وصفة طبية', 'PHAR437', ['PHAR422','PHAR301']],
    ['العلاج الدوائي 1', 'PHAR452', ['PHAR342','PHAR351','PHAR431','PHAR421']],

    'year 5 semester 1',
    ['مضادات حيوية ومناعة', 'PHAR532', ['PHAR342','BIOL243']],
    ['حركية الدواء السريرية', 'PHAR535', ['PHAR434']],
    ['العلاج الدوائي 2', 'PHAR554', ['PHAR452']],
    ['اختياري جامعة 1', ' ', []],

    'year 5 semester 2',
    ['إدارة الصيدليات', 'PHAR522', ['PHAR301']],
    ['مشروع بحثي في الصيدلة', 'PHAR523', ['PHAR452']],
    ['العلاج الدوائي 3', 'PHAR555', ['PHAR554']],
    ['التربية الرياضية', 'PHED120', []],
    ['العلاج الدوائي 1', 'PHAR452', []],
    ['اختياري جامعة 1', ' ', []],

    'year 6 semester 1',
    ['تدريب سريري 2', 'PHAR642', ['COMP333'], 'مستوى سنة سادسة'],
    ['تدريب سريري 3', 'PHAR643', ['ENCS3130', 'ENCS3390'], 'مستوى سنة سادسة'],
    ['تدريب سريري 4', 'PHAR644', [], 'مستوى سنة سادسة'],
    ['تدريب سريري 5', 'PHAR645', [], 'مستوى سنة سادسة'],

    'year 6 semester 2',
    ['تدريب سريري 6', 'PHAR646', ['ENCS5200'], 'مستوى سنة سادسة'],
    ['تدريب سريري 7', 'PHAR647', [], 'مستوى سنة سادسة'],
    ['تدريب سريري 8', 'PHAR648', [], 'مستوى سنة سادسة'],
    ['تدريب سريري 9', 'PHAR649', [], 'مستوى سنة سادسة']
];