const title = 'Birzeit University Contemporary Visual Art Advisory Plan';
const link_title = ' ';
const url = ' ';
const link_more_info = ' ';
const courses = [
    //['NAME', 'CODE', ['requirement']s, 'notes']
    //'year 1 semester 1',
    ['استوديو فنون بصرية تأسيسي', 'COVA1320',[],'موافقة الكلية'],
    ['مقدمة إلى تاريخ الفن البصري والتصميم', 'COVA1210', [],'موافقة الكلية'],
    ['استوديو مهارات الرسم التأسيسية', 'COVA1310', [],'موافقة الكلية'],
    ['مقدمة إلى المختبرات والمشاغل', 'COVA1380', []],
    ['مهارات اللغة العربية 1', 'ARAB135', []],
    ['لغة إنجليزية مستوى متوسط 3', 'ENGC2201', []],

    'year 1 semester2',
    ['الفن البصري العربي والفلسطيني', 'COVA1220', ['COVA1210']],
    ['تاريخ وثقافة الجسد', 'COVA1300', [],'موافقة الكلية'],
    ['تاريخ وسياسات الصورة المتحركة', 'COVA1330', [],'موافقة الكلية'],
    [' مقدمة إلى استوديو التصوير الفوتوغرافي', 'COVA1350', [],'موافقة الكلية'],
    ['استوديو الرسم 1', 'COVA1360', ['COVA1320','COVA1310']],
    ['لغة إنجليزية مستوى متوسط 4', 'ENGC2202', ['ENGC2201']],
    ['لغة إنجليزية مستوى متقدم 1', 'ENGC2203', ['ENGC2202'], 'يؤخذ صيفا', 7],

    'year 2 semester 1',
    ['الفن البصري في العصر القديم وعصر النهضة', 'COVA2210', ['COVA1210']],
    ['سياسات الفضاء', 'COVA2300', []],
    ['ثقافة بصرية معاصرة', 'COVA2310', [],'موافقة الكلية'],
    ['استوديو النحت 1', 'COVA2330', ['COVA1320','COVA1310']],
    ['استوديو التصوير الفوتوغرافي والفوتوشوب', 'COVA2350', ['COVA1350']],
    ['لغة إنجليزية مستوى متقدم 2', 'ENGC2204', ['ENGC2203']],

    'year 2 semester 2',
    ['الفن البصري بين القرنين السادس عشر والتاسع عشر', 'COVA2220', ['COVA1210']],
    [' منهجية البحث والكتابة في الفن البصري', 'COVA2270', ['ARAB135','ENGC2204'],'أو ENGC2202 أو ENGC2305'],
    [' سياسات وثقافة الجماليات', 'COVA2340', [],'موافقة الكلية'],
    ['استوديو الرسم 2', 'COVA2360', ['COVA1360']],
    ['استوديو فن الفيديو 1', 'COVA2370', ['COVA1320','COVA1310']],
    ['استوديو الأداء 1', 'COVA2390', ['COVA1320','COVA1310']],

    'year 3 semester 1',
    ['مهارات اللغة العربية 2', 'ARAB136', ['ARAB135']],
    ['الفن البصري في القرن العشرين', 'COVA3210', ['COVA1210']],
    ['استوديو المشروع الفردي 1', 'COVA3300', [],'موافقة البرنامج'],
    ['استوديو النحت والتركيب 2', 'COVA3330', ['COVA2330']],
    ['الحضارة الاوروبية الحديثه والمعاصره', 'CULS331', [],'يجب انهاء 30 ساعة'],
    ['اختياري تخصص', ' ', [],`<table><tr><th>الرمز</th><th>المادة</th></tr>
                               <tr><td>COVA3350</td><td>استوديو التصوير الفوتوغرافي المتقدم</td></tr>
                               <tr><td>COVA335</td><td>تاريخ وسياسات في االنتاج الفني</td></tr>
                               <tr><td>COVA3360</td><td>استوديو الرسم 3</td></tr>
                               <tr><td>COVA338</td><td>تدخالت فنية مجتمعية</td></tr>
                               <tr><td>COVA3390</td><td>استوديو الأداء 2</td></tr>
                               </table>`],

    'year 3 semester 2',
    ['استوديو ممارسة المعرض 1', 'COVA3220', ['COVA3300']],
    ['استوديو المشروع الفردي 2', 'COVA3310', ['COVA3300']],
    ['الفن البصري في القرن الواحد والعشرين', 'COVA3320', ['COVA1210']],
    ['استوديو فن الفيديو 2', 'COVA3370', ['COVA2370']],
    ['اختياري تخصص', ' ', [],`<table><tr><th>الرمز</th><th>المادة</th></tr>
                               <tr><td>COVA3350</td><td>استوديو التصوير الفوتوغرافي المتقدم</td></tr>
                               <tr><td>COVA335</td><td>تاريخ وسياسات في االنتاج الفني</td></tr>
                               <tr><td>COVA3360</td><td>استوديو الرسم 3</td></tr>
                               <tr><td>COVA338</td><td>تدخالت فنية مجتمعية</td></tr>
                               <tr><td>COVA3390</td><td>استوديو الأداء 2</td></tr>
                               </table>`],
    ['الفكر العربي الحديث والمعاصر', 'CULS332', [],'يجب انهاء 30 ساعة'],
    ['الكتف حر', ' ', [],' ساعتين على سبيل المثال'],

    ['التدريب العملي', 'COVA3240', ['COVA3300'], 'يؤخذ صيفا',9],

    'year 4 semester 1',
    ['حلقة بحث', 'COVA4300', ['COVA2270']],
    ['استوديو ممارسة فنية بصرية 1', 'COVA4311', [],'انهاء ما لا يقل عن 90 ساعة معتمدة'],
    ['استوديو ممارسة المعرض 2', 'COVA4320', ['COVA3310']],
    ['حوارات معاصرة في ممارسات الفن البصري ', 'COVA4380', ['COVA1210']],
    ['اختياري تخصص', ' ', [],`<table><tr><th>الرمز</th><th>المادة</th></tr>
                               <tr><td>COVA436</td><td> مواضيع مختارة في الفنون البصرية المعاصرة</td></tr>
                               <tr><td>COVA437</td><td>مهارات مهنية تطويرية</td></tr>
                               </table>`],

    'year 4 semester 2',
    ['استوديو ممارسة المعرض 3', 'COVA4330', ['COVA4320']],
    ['استوديو ممارسة فنية بصرية 2', 'COVA4411', ['COVA4311']],
    ['اختياري تخصص', ' ', [],`<table><tr><th>الرمز</th><th>المادة</th></tr>
                               <tr><td>COVA436</td><td> مواضيع مختارة في الفنون البصرية المعاصرة</td></tr>
                               <tr><td>COVA437</td><td>مهارات مهنية تطويرية</td></tr>
                               </table>`],
    ['الكتف حر', ' ', []],
    ['الكتف حر', ' ', []]
];
