const title = 'Birzeit University Design Advisory Plan';
const link_title = ' ';
const url = ' ';
const link_more_info = ' ';
const courses = [
    //['NAME', 'CODE', ['requirement']s, 'notes']
    //'year 1 semester 1',
    ['ستوديو التصميم 1: الأساسيات 1', 'DSGN1420',[],'موافقة الدائرة'],
    ['مهارات الرسم التأسيسية', 'DSGN1310', [],'موافقة الدائرة'],
    ['تاريخ التصميم 1', 'DSGN1220', [],'موافقة الدائرة'],
    ['مقدمة إلى المختبرات والمشاغل', 'DSGN1381', []],
    ['مهارات اللغة العربية 1', 'ARAB135', []],
    ['لغة إنجليزية مستوى متوسط 3', 'ENGC2201', []],

    'year 1 semester2',
    ['ستوديو التصميم 2: الأساسيات 2', 'DSGN1460', ['DSGN1310','DSGN1420']],
    ['التصميم الجرافيكي وتقنيات الكمبيوتر', 'DSGN1350', ['DSGN1310']],
    ['صناعة الصورة', 'DSGN1340', ['DSGN1310']],
    [' تاريخ التصميم 2', 'DSGN1260', ['DSGN1220']],
    ['تاريخ وثقافة الجسد', 'COVA1300', []],
    ['مهارات اللغة العربية 2', 'ARAB136', ['ARAB135']],
    ['لغة إنجليزية مستوى متوسط 4', 'ENGC2202', ['ENGC2201']],


    'year 2 semester 1',
    ['ستوديو التصميم 3: تصميم الأزياء', 'DSGN2430', ['DSGN1460']],
    ['مقدمة في تقنيات الأزياء', 'DSGN2320', ['DSGN1340','DSGN1350']],
    ['مهارات النماذج والطباعة', 'DSGN2350', ['DSGN1340','DSGN1350']],
    ['مقدمة في نظريات التصميم', 'DSGN2230', ['DSGN1260']],
    ['سياسات الفضاء', 'COVA2300', []],
    ['لغة إنجليزية مستوى متقدم 1', 'ENGC2203', ['ENGC2202']],
    ['الكتف حر', ' ', []],

    'year 2 semester 2',
    ['ستوديو التصميم 4: تصميم الأثاث والمنتجات', 'DSGN2460', ['DSGN2430']],
    [' تقنيات الأزياء والنسيج', 'DSGN2330', ['DSGN2320']],
    [' المشاغل 1: الخشب والحديد', 'DSGN2381', ['DSGN1381','DSGN2320']],
    ['الصناعات المحلية والإقليمية', 'DSGN2270', [],'موافقة الدائرة'],
    ['تاريخ وسياسات الصورة المتحركة', 'COVA1330', []],
    ['لغة إنجليزية مستوى متقدم 2', 'ENGC2204', ['ENGC2203']],

    'year 3 semester 1',
    ['ستوديو تصميم متقدم 1', 'DSGN3410', ['DSGN2460']],
    ['المشاغل 2: القوالب والسيراميك والنماذج', 'DSGN3380', ['DSGN2381']],
    ['تصميم العلامات التجارية', 'DSGN3320', ['DSGN2350']],
    ['التصميم والمواد', 'DSGN3240', ['DSGN2381']],
    ['الحضارة الاوروبية الحديثه والمعاصره', 'CULS331', [],'يجب انهاء 30 ساعة'],
    ['اختياري تخصص', ' ', [],`<table><tr><th>الرمز</th><th>المادة</th></tr>
                               <tr><td>DSGN3360</td><td>التصميم الشامل</td></tr>
                               <tr><td>DSGN3370</td><td>تصميم النسيج</td></tr>
                               <tr><td>DSGN3390</td><td>تصميم المستقبل: الاتجاهات والسوق</td></tr>
                               </table>`],

    'year 3 semester 2',
    ['ستوديو تصميم متقدم 2', 'DSGN3430', ['DSGN3410']],
    ['حلقة بحث', 'DSGN3330', ['DSGN3410']],
    ['سياسات وثقافة الجماليات', 'COVA2340', []],
    ['اختياري تخصص', ' ', [],`<table><tr><th>الرمز</th><th>المادة</th></tr>
                               <tr><td>DSGN3360</td><td>التصميم الشامل</td></tr>
                               <tr><td>DSGN3370</td><td>تصميم النسيج</td></tr>
                               <tr><td>DSGN3390</td><td>تصميم المستقبل: الاتجاهات والسوق</td></tr>
                               </table>`],
    ['الفكر العربي الحديث والمعاصر', 'CULS332', [],'يجب انهاء 30 ساعة'],
    ['الكتف حر', ' ', [],' ساعتين على سبيل المثال'],

    ['التدريب العملي', 'DSGN3340', ['DSGN3430'], 'يؤخذ صيفا', 7],

    'year 4 semester 1',
    ['مشروع التخرج 1', 'DSGN4411', ['DSGN3340','DSGN3320']],
    ['بيئة العمل: تصميم محوره الإنسان', 'DSGN4220', ['DSGN3430']],
    ['ثقافة بصرية معاصرة', 'COVA2310', []],
    ['الكتف حر', ' ', [],' ثلاث ساعات على سبيل المثال'],

    'year 4 semester 2',
    ['مشروع التخرج 2', 'DSGN4441', ['DSGN4411']],
    ['الريادة والابتكار', 'DSGN4320', ['DSGN3320']],
    ['اختياري تخصص', ' ', [],`<table><tr><th>الرمز</th><th>المادة</th></tr>
                               <tr><td>DSGN4360</td><td>الاستدامة والتصميم</td></tr>
                               <tr><td>DSGN4380</td><td>التفكير التصميمي</td></tr>
                               <tr><td>DSGN4390</td><td>سرد القصة والقصة المصورة</td></tr>
                               </table>`],
    ['الكتف حر', ' ', [],'ساعتين على سبيل المثال']
];
