const title = 'Birzeit University Electrical Engineering Advisory Plan';
const link_title = ' ';
const url = ' ';
const link_more_info = ' ';
/*
    notes:-
        1) course format is //['NAME', 'CODE', ['requirement']s, 'notes']
        2) 'notes' is not required
        3) you have to separate between the semesters by a string like: '', 'year 1 semester2'
        4) when there no requirements leave the array empty [] not ['']
        5) when there no 'CODE' (course code) write ' ' not ''
        6) you can use html tags like table, like: `<table><tr><th>المتطلبات</th><th>المادة</th></tr>
                                                    <tr><td>ENCS3320</td><td>*(2)شبكات الحاسوب المتقدمة</td></tr>
                                                    <tr><td>ENCS4370, ENCS3390</td><td>*(3)عمارة الحاسبات المتقدمة</td></tr>
                                                    <tr><td>ENCS3340</td><td>*(4)تعلم الآلة وعلم البيانات</td></tr>
                                                    </table>`
                                                    or
                                                    '<table><tr><th>المتطلبات</th><th>المادة</th></tr>'
                                                    + '<tr><td>ENCS3320</td><td>*(2)شبكات الحاسوب المتقدمة</td></tr>'
                                                    + '<tr><td>ENCS4370, ENCS3390</td><td>*(3)عمارة الحاسبات المتقدمة</td></tr>'
                                                    + '<tr><td>ENCS3340</td><td>*(4)تعلم الآلة وعلم البيانات</td></tr>'
                                                    + '</table>'
        7) separatelines in notes by <br> not \n like: '*COMP230 أو COMP133<br>*مستوى سنة 3'
*/
const courses = [
    //['NAME', 'CODE', ['requirement']s, 'notes']
    //'year 1 semester 1',
    ['التفاضل والتكامل 1', 'MATH1411', []],
    ['الفيزياء العامة 1', 'PHYS141',[]],
    ['مختبر الفيزياء العامة 1', 'PHYS111', ['PHYS141']],
    ['مشغل', 'ENME120', []],
    ['مهارات اللغة العربية 1', 'ARAB135', []],
    ['لغة إنجليزية مستوى متوسط 3', 'ENGC2201', []],

    'year 1 semester2',
    ['التفاضل والتكامل 2', 'MATH1321', ['MATH1411']],
    ['الفيزياء العامة 2', 'PHYS132', ['PHYS141', 'MATH1411']],
    ['مختبر الفيزياء العامة 2', 'PHYS112', ['PHYS132', 'PHYS111']],
    ['الكيمياء لطلبة كلية الهندسة', 'CHEM143', []],
    ['مهارات اللغة العربية 2', 'ARAB136', ['ARAB135']],
    ['الرسم الهندسي', 'ENME121', []],
    ['لغة إنجليزية مستوى متوسط 4', 'ENGC2202', ['ENGC2201']],

    'year 2 semester 1',
    ['التفاضل والتكامل والهندسة التحليلية 3', 'MATH2311', ['MATH1321']],
    ['المعادلات التفاضلية العادية', 'MATH331', ['MATH1321']],
    ['مقدمة في الجبر الخطي', 'MATH234', ['MATH1321']],
    ['الحاسوب والبرمجة', 'COMP133', []],
    ['الدوائر الكهربائية 1', 'ENEE2311', ['PHYS132']],
    ['اللغة الإنجليزية المتقدمة 1', 'ENGC2203', ['ENGC2202']],

    'year 2 semester 2',
    ['الدوائر الكهربائية 2', 'ENEE2315', ['ENEE2312' ,'ENEE2311'],'متزامن'],
    ['الاشارات واالانظمة', 'ENEE2312', ['MATH331']],
    ['الالكترونيات 1', 'ENEE2313', ['ENEE2311']],
    ['انظمة رقمية', 'ENCS2340', ['COMP133']],
    ['الاحتماالات والاحصاء الهندسي', 'ENEE2307', ['PHYS132', 'MATH331']],
    ['مختبر الدوائر الكهربائية', 'ENEE2102', ['PHYS112', 'ENEE2315'] ,'أو متزامن'],
    ['لغة انجليزية مستوى متقدم 2', 'ENGC2204', ['ENGC2203']],

        'year 3 semester 1',
        ['أنظمة الاتصالات', 'ENEE3309', ['ENEE2312', 'ENEE2307']],
        ['الالكترونيات 2', 'ENEE3304', ['ENEE2313']],
        ['الآلات الكهربائية', 'ENEE2408', ['ENEE2311']],
        ['الكهرومغناطيسية', 'ENEE3318', ['PHYS132', 'MATH2311']],
        ['التركيبات والمخططات الكهربائية', 'ENEE4202', ['ENEE2311']],
        ['مختبر الالكترونيات', 'ENEE3112', ['PHYS112', 'ENEE3304']],

        'year 3 semester 2',
        ['اتصالات وشبكات المعلومات', 'ENEE3401', ['ENEE3309']],
        ['إلكترونيات القوى', 'ENEE3305', ['ENEE2312', 'ENEE2313'],'متزامن'],
        ['مختبر آلالات الكهربائية', 'ENEE3101', ['ENEE2102, ENEE2408']],
        ['تنظيم وتركيب الحاسوب', 'ENCS2308', ['ENCS2340']],
        ['الاستاتيكا', 'ENCE232', ['PHYS141']],
        ['مختبر الإلكترونيات الرقمية وتنظيم الحاسوب', 'ENCS2110', ['ENCS2308']],

        'year 4 semester 1',
        ['مختبر التصاالات', 'ENEE4113', ['ENEE3309']],
        ['الكهرومغناطيسية التطبيقية –تركيز ص', 'ENEE4305', ['ENEE3318']],
        ['أنظمة التحكم 1', 'ENEE4302', ['ENEE2315', 'ENEE2312']],
        ['أنظمة القوى الكهربائية', 'ENEE4403', ['ENEE2408']],
        ['مختبر محاكاة هندسية', 'ENEE4104', ['ENEE3304','ENEE2408']],
        ['إدارةآلات كهربائية وأنواع خاصة من الآلات الكهربائية' , 'ENEE5303', ['ENEE2408','ENEE3305']],
        ['مبادئ وتطبيقات كهرو ميكانيكية', 'ENEE3308', ['PHYS141']],
        ['طرق التحليل العددي', 'MATH330', ['COMP133']],

        'year 4 semester 2',
        ['نظرية المعلومات والترميز –تركيز ص', 'ENEE5304', ['ENEE3309']],
        ['التصاالات الالسلكية –تركيز ص', 'ENEE5305', ['ENEE3401']],
        ['الحماية والأتمتة في أنظمة القوى الكهربائية -تركيز ط', 'ENEE5306', ['ENEE4403']],
        ['الطاقة المتجددة وأنظمة القدرة الكهروضوئية-تركيز ط', 'ENEE5307', ['ENEE3305', 'ENEE2408']],
        ['مختبر التحكم والكترونيات القوى', 'ENEE4105', ['ENEE3305', 'ENEE4302']],
        ['أجهزة وقياسات', 'ENEE4304', ['ENCS2308, ENEE3304']],
        ['المعالجات والأنظمة المدمجة', 'ENCS4308', ['ENCS2308']],
        ['الحضارة الأوروبية المعاصرة', 'CULS331', [],'يجب انهاء 30 ساعة'],
        ['التدريب العملي', 'ENEE4300', [], 'سنة رابعة وموافقة الدائرة<br>يؤخذ صيفا', 2],


        'year 5 semester 1',
        [' إدارة المشاريع الهندسية', 'BUSA2302', []],
        ['مختبر متقدم في الاتصاالت', 'ENEE5111', ['ENEE3401','ENEE4113']],
        ['مقدمة مشروع التخرج', 'ENEE5200', ['ENEE4300']],
        ['مختبر القوى', 'ENEE5102', ['ENEE4403','ENEE5303']],
        ['اختياري جامعة 1', ' ', [], 'حسب دائرة المساق'],
        ['اختياري دائرة', ' ', [], 'حسب دائرة المساق'],
        [' مختبر المعالجات الدقيقة والأنظمة المدمجة', 'ENCS5101', ['ENCS4308']],

        'year 5 semester 2',
        ['مشروع التخرج', 'ENEE5300', ['ENEE4300','ENEE5200']],
        ['اختياري جامعة 2', ' ', [], 'حسب دائرة المساق'],
        ['الفكر العربي المعاصر', 'CULS332', [],'يجب انهاء 30 ساعة']
    ];
