const title = 'Birzeit University Geoinformatics Advisory Plan';
const link_title = ' ';
const url = ' ';
const link_more_info = ' ';
const courses = [
    //['NAME', 'CODE', ['requirement']s, 'notes']
    //'year 1 semester 1',
    ['مبادىء الخرائط الكارتوغرافي', 'GEOG232',[]],
    ['أسس الجغرافيا الطبيعية والبشرية', 'GEOI2300', []],
    ['مناهج البحث الجغرافي', 'GEOI2320', []],
    ['مهارات اللغة العربية 1', 'ARAB135', []],
    ['لغة إنجليزية مستوى متوسط 3', 'ENGC2201', []],
    ['اختياري كلية', ' ', []],

    'year 1 semester2',
    ['أنظمة الإحداثيات والإسقاطات', 'GEOI2330', ['GEOG232']],
    [' مدخل إلى نظم المعلومات الجغرافية', 'GEOI2340', ['GEOG232']],
    ['تقنيات جمع البيانات الجغرافية', 'GEOI2360', []],
    ['مهارات اللغة العربية 2', 'ARAB136', ['ARAB135']],
    ['لغة إنجليزية مستوى متوسط 4', 'ENGC2202', ['ENGC2201']],
    ['اختياري كلية', ' ', []],

    'year 2 semester 1',
    ['مدخل الى الاستشعار عن بعد', 'GEOG335', ['GEOG232']],
    ['جغرافية البيئة', 'GEOG336', []],
    ['مقدمة في البرمجة لنظم المعلومات الجغرافية', 'GEOI2380', ['GEOI2340']],
    ['لغة إنجليزية مستوى متقدم 1', 'ENGC2203', ['ENGC2202']],
    ['اختياري تخصص', ' ', []],

    'year 2 semester 2',
    ['تحليل الخرائط الصورية', 'GEOI3300', ['GEOI2340']],
    [' قواعد البيانات الجغرافية', 'GEOI3320', ['GEOI2340']],
    [' التحليل الإحصائي الحيزي', 'GEOI3340', ['GEOI2340']],
    ['لغة إنجليزية مستوى متقدم 2', 'ENGC2204', ['ENGC2203']],
    ['اختياري تخصص', ' ', []],

    'year 3 semester 1',
    ['إدارة المصادر الطبيعية', 'GEOI3360', ['GEOI2340']],
    ['تطبيقات في الاستشعار عن بعد', 'GEOI3380', ['GEOG335']],
    ['اختياري تخصص', ' ', []],
    ['اختياري كلية', ' ', []],
    ['الحضارة الأوروبية المعاصرة', 'CULS331', [],'يجب انهاء 30 ساعة'],

    'year 3 semester 2',
    ['جغرافية التنمية والتخطيط الاقليمي', 'GEOG435', ['GEOI2300']],
    ['اختياري تخصص', ' ', []],
    ['اختياري كلية', ' ', []],
    ['اختياري كلية', ' ', []],
    ['الفكر العربي المعاصر', 'CULS332', [],'يجب انهاء 30 ساعة'],

    'year 4 semester 1',
    ['المساحة العقارية', 'GEOI4300', ['GEOI2340']],
    ['اختياري تخصص', ' ', []],
    ['اختياري كلية', ' ', []],
    ['مساق اختياري', ' ', []],
    ['مساق اختياري', ' ', []],

    'year 4 semester 2',
    ['مشروع تخرج', 'GEOI4380', [],' إنهاء ما لا يقل عن 90 ساعة'],
    ['اختياري تخصص', ' ', [],'إنهاء 3 ساعات من مستوى سنة ثالثة أو رابعة من مساقات الجغرافيا GEOG'],
    ['اختياري كلية', ' ', []],
    ['مساق اختياري', ' ', []],
    ['مساق اختياري', ' ', []]
];
